import React from 'react'
import MoreHeader from '../../../components/header/more-header/MoreHeader'
import Footer from '../../../components/footer/Footer'

import './privacy-policy.css'

const PrivacyPolicy = () => {

    window.scrollTo(0, 0)

    return (
        <div className={'privacy-policy'}>
            <MoreHeader pageName={'Политика конфиденциальности'}/>
            <div className={'privacy-policy-info'}>Настоящая Политика конфиденциальности персональных
                данных (далее – Политика конфиденциальности) действует
                в отношении всей информации, которую сайт "Тренажерный
                зал Железная семья", (далее – Сайт) расположенный на
                доменном имени if76.ru (а также его субдоменах), может
                получить о Пользователе во время использования сайта
                if76.ru(а также его субдоменов), его программ и его
                продуктов. Определение терминов 1.1 В настоящей Политике
                конфиденциальности используются следующие термины:
                1.1.1. «Администрация сайта» (далее – Администрация)
                – уполномоченные сотрудники на управление Сайтом,
                которые организуют и (или) осуществляют обработку персональных
                данных, а также определяет цели обработки персональных данных,
                состав персональных данных, подлежащих обработке, действия
                (операции), совершаемые с персональными данными. 1.1.2. «Персональные данные»
                — любая информация, относящаяся к прямо или косвенно определенному,
                или о пределяемому физическому лицу (субъекту персональных данных).
                1.1.3. «Обработка персональных данных» — любое действие (операция)
                или совокупность действий (операций), совершаемых с использованием
                средств автоматизации или без использования таких средств с
                персональными данными, включая сбор, запись, систематизацию,
                накопление, хранение, уточнение (обновление, изменение), извлечение,
                использование, передачу (распространение, предоставление, доступ),
                обезличивание, блокирование, удаление, уничтожение персональных
                данных. 1.1.4. «Конфиденциальность персональных данных» — обязательное
                для соблюдения Оператором или иным получившим доступ к персональным
                данным лицом требование не допускать их распространения без согласия
                субъекта персональных данных или наличия иного законного основания.
                1.1.5. «Сайт» — это совокупность связанных между собой веб-страниц,
                размещенных в сети Интернет по уникальному адресу (URL): www.if76.ru,
                а также его субдоменах. 1.1.6. «Субдомены» — это страницы или совокупность
                страниц, расположенные на доменах третьего уровня, принадлежащие Сайту,
                а также другие временные страницы, внизу который указана контактная
                информация Администрации 1.1.5. «Пользователь сайта» (далее Пользователь)
                – лицо, имеющее доступ к сайту Сайту, посредством сети Интернет и
                использующее информацию, материалы и продукты Сайта. 1.1.7. «Cookies» —
                небольшой фрагмент данных, отправленный веб-сервером и хранимый на
                компьютере пользователя, который веб-клиент или веб-браузер каждый раз
                пересылает веб-серверу в HTTP-запросе при попытке открыть страницу
                соответствующего сайта. 1.1.8. «IP-адрес» — уникальный сетевой адрес
                узла в компьютерной сети, через который Пользователь получает доступ
                на Сайт. 1.1.9. «Товар» — продукт, услуга которые Пользователь заказывает
                на сайте и оплачивает через платёжные системы. Общие положения 2.1.
                Использование Сайта Пользователем означает согласие с настоящей Политикой
                конфиденциальности и условиями обработки персональных данных Пользователя.
                2.2. В случае несогласия с условиями Политики конфиденциальности Пользователь
                должен прекратить использование Сайта. 2.3. Настоящая Политика
                конфиденциальности применяется к Сайту. Сайт не контролирует и не
                несет ответственность за сайты третьих лиц, на которые Пользователь
                может перейти по ссылкам, доступным на Сайте. 2.4. Администрация не
                проверяет достоверность персональных данных, предоставляемых Пользователем.
                Предмет политики конфиденциальности 3.1. Настоящая Политика конфиденциальности
                устанавливает обязательства Администрации по неразглашению и обеспечению
                режима защиты конфиденциальности персональных данных, которые Пользователь
                предоставляет по запросу Администрации при регистрации на Сайте, при
                подписке на информационную e-mail рассылку или при оформлении заказа.
                3.2. Персональные данные, разрешённые к обработке в рамках настоящей
                Политики конфиденциальности, предоставляются Пользователем путём
                заполнения форм на Сайте и включают в себя следующую информацию:
                3.2.1. фамилию, имя, отчество Пользователя; 3.2.2. контактный телефон
                Пользователя; 3.2.3. адрес электронной почты (e-mail) 3.2.4. место
                жительство Пользователя (при необходимости) 3.2.5. адрес доставки
                Товара (при необходимости) 3.2.6. фотографию (при необходимости).
                3.3. Сайт защищает Данные, которые автоматически передаются при
                посещении страниц: — IP адрес; — информация из cookies; — информация
                о браузере — время доступа; — реферер (адрес предыдущей страницы).
                3.3.1. Отключение cookies осуществляется пользователем в браузере
                самостоятельно, по индивидуальному желанию, может повлечь невозможность
                доступа к частям Сайта, требующим авторизации. 3.3.2. Сайт осуществляет
                сбор статистики об IP-адресах своих посетителей. Данная информация
                используется с целью предотвращения, выявления и решения технических
                проблем. 3.4. Любая иная персональная информация неоговоренная выше
                (история посещения, используемые браузеры, операционные системы и т.д.)
                подлежит надежному хранению и нераспространению, за исключением случаев,
                предусмотренных в п.п. 5.2. и 5.3. настоящей Политики конфиденциальности.
                Цели сбора персональной информации пользователя 4.1. Персональные данные
                Пользователя Администрация может использовать в целях: 4.1.1. Идентификации
                Пользователя, зарегистрированного на Сайте для его дальнейшей авторизации,
                оформления заказа и других действий. 4.1.2. Предоставления Пользователю
                доступа к персонализированным данным Сайта. 4.1.3. Установления с Пользователем
                обратной связи, включая направление уведомлений, запросов, касающихся
                использования Сайта, оказания услуг и обработки запросов и заявок от
                Пользователя. 4.1.4. Определения места нахождения Пользователя для обеспечения
                безопасности, предотвращения мошенничества. 4.1.5. Подтверждения достоверности
                и полноты персональных данных, предоставленных Пользователем. 4.1.6. Создания
                учетной записи для использования частей Сайта, если Пользователь дал согласие
                на создание учетной записи. 4.1.7. Уведомления Пользователя по электронной почте.
                4.1.8. Предоставления Пользователю эффективной технической поддержки
                при возникновении проблем, связанных с использованием Сайта. Способы и
                сроки обработки персональной информации 5.1. Обработка персональных данных
                Пользователя осуществляется с момента получения услуги до момента отзыва
                субъектом персональных данных. 5.2. Пользователь соглашается с тем, что Администрация
                вправе передавать персональные данные третьим лицам, в частности, курьерским службам,
                организациями почтовой связи (в том числе электронной), операторам электросвязи,
                исключительно в целях выполнения заказа Пользователя, оформленного на Сайте, включая
                доставку Товара, документации или e-mail сообщений. 5.3. Персональные данные Пользователя
                могут быть переданы уполномоченным органам государственной власти Российской
                Федерации только по основаниям и в порядке, установленным законодательством
                Российской Федерации. 5.4. При утрате или разглашении персональных данных
                Администрация вправе не информировать Пользователя об утрате или разглашении
                персональных данных. 5.5. Администрация принимает необходимые организационные и
                технические меры для защиты персональной информации Пользователя от неправомерного
                или случайного доступа, уничтожения, изменения, блокирования, копирования, распространения,
                а также от иных неправомерных действий третьих лиц. 5.6. Администрация совместно с
                Пользователем принимает все необходимые меры по предотвращению убытков или иных отрицательных
                последствий, вызванных утратой или разглашением персональных данных Пользователя.
                Права и обязанности сторон 6.1. Пользователь вправе: 6.1.1. Принимать свободное
                решение о предоставлении своих персональных данных, необходимых для использования
                Сайта, и давать согласие на их обработку. 6.1.2. Обновить, дополнить предоставленную
                информацию о персональных данных в случае изменения данной информации. 6.1.3.
                Пользователь имеет право на получение у Администрации информации, касающейся обработки
                его персональных данных, если такое право не ограничено в соответствии с федеральными
                законами. Пользователь вправе требовать от Администрации уточнения его персональных данных,
                их блокирования или уничтожения в случае, если персональные данные являются неполными,
                устаревшими, неточными, незаконно полученными или не являются необходимыми для заявленной
                цели обработки, а также принимать предусмотренные законом меры по защите своих прав. 6.2.
                Администрация обязана: 6.2.1. Использовать полученную информацию исключительно для целей,
                указанных в п. 4 настоящей Политики конфиденциальности. 6.2.2. Обеспечить хранение конфиденциальной
                информации в тайне, не разглашать без предварительного письменного разрешения Пользователя, а
                также не осуществлять продажу, обмен, опубликование, либо разглашение иными возможными
                способами переданных персональных данных Пользователя, за исключением п.п. 5.2 и 5.3.
                настоящей Политики Конфиденциальности. 6.2.3. Принимать меры предосторожности для защиты
                конфиденциальности персональных данных Пользователя согласно порядку, обычно используемого
                для защиты такого рода информации в существующем деловом обороте. 6.2.4. Осуществить
                блокирование персональных данных, относящихся к соответствующему Пользователю, с момента
                обращения или запроса Пользователя, или его законного представителя либо уполномоченного
                органа по защите прав субъектов персональных данных на период проверки, в случае выявления
                недостоверных персональных данных или неправомерных действий. Ответственность сторон 7.1.
                Администрация, не исполнившая свои обязательства, несёт ответственность за убытки,
                понесённые Пользователем в связи с неправомерным использованием персональных данных, в
                соответствии с законодательством Российской Федерации, за исключением случаев,
                предусмотренных п.п. 5.2., 5.3. и 7.2. настоящей Политики Конфиденциальности. 7.2.
                В случае утраты или разглашения Конфиденциальной информации Администрация не несёт
                ответственность, если данная конфиденциальная информация: 7.2.1. Стала публичным достоянием
                до её утраты или разглашения. 7.2.2. Была получена от третьей стороны до момента её
                получения Администрацией Ресурса. 7.2.3. Была разглашена с согласия Пользователя. 7.3.
                Пользователь несет полную ответственность за соблюдение требований законодательства РФ,
                в том числе законов о рекламе, о защите авторских и смежных прав, об охране товарных знаков
                и знаков обслуживания, но не ограничиваясь перечисленным, включая полную ответственность
                за содержание и форму материалов. 7.4. Пользователь признает, что ответственность за
                любую информацию (в том числе, но не ограничиваясь: файлы с данными, тексты и т. д.),
                к которой он может иметь доступ как к части Сайта, несет лицо, предоставившее такую информацию.
                7.5. Пользователь соглашается, что информация, предоставленная ему как часть Сайта, может
                являться объектом интеллектуальной собственности, права на который защищены и принадлежат
                другим Пользователям, партнерам или рекламодателям, которые размещают такую информацию на
                Сайте. Пользователь не вправе вносить изменения, передавать в аренду, передавать на условиях
                займа, продавать, распространять или создавать производные работы на основе такого Содержания
                (полностью или в части), за исключением случаев, когда такие действия были письменно прямо
                разрешены собственниками такого Содержания в соответствии с условиями отдельного соглашения.
                7.6. В отношение текстовых материалов (статей, публикаций, находящихся в свободном публичном
                доступе на Сайте) допускается их распространение при условии, что будет дана ссылка на Сайт.
                7.7. Администрация не несет ответственности перед Пользователем за любой убыток или ущерб,
                понесенный Пользователем в результате удаления, сбоя или невозможности сохранения какого-либо
                Содержания и иных коммуникационных данных, содержащихся на Сайте или передаваемых через него.
                7.8. Администрация не несет ответственности за любые прямые или косвенные убытки, произошедшие
                из-за: использования либо невозможности использования сайта, либо отдельных сервисов;
                несанкционированного доступа к коммуникациям Пользователя; заявления или поведение любого
                третьего лица на сайте. 7.9. Администрация не несет ответственность за какую-либо информацию,
                размещенную пользователем на Сайте, включая, но не ограничиваясь: информацию, защищенную
                авторским правом, без прямого согласия владельца авторского права. Разрешение споров 8.1.
                До обращения в суд с иском по спорам, возникающим из отношений между Пользователем и Администрацией,
                обязательным является предъявление претензии (письменного предложения или предложения в
                электронном виде о добровольном урегулировании спора). 8.2. Получатель претензии в течение
                30 календарных дней со дня получения претензии, письменно или в электронном виде уведомляет
                заявителя претензии о результатах рассмотрения претензии. 8.3. При не достижении соглашения
                спор будет передан на рассмотрение Арбитражного суда г. Ярославль. 8.4. К настоящей Политике
                конфиденциальности и отношениям между Пользователем и Администрацией применяется действующее
                законодательство Российской Федерации. Дополнительные условия 9.1. Администрация вправе
                вносить изменения в настоящую Политику конфиденциальности без согласия Пользователя. 9.2.
                Новая Политика конфиденциальности вступает в силу с момента ее размещения на Сайте, если
                иное не предусмотрено новой редакцией Политики конфиденциальности. 9.3. Все предложения или
                вопросы касательно настоящей Политики конфиденциальности следует сообщать по адресу:
                ifangardgym@mail.ru 9.4. Действующая Политика конфиденциальности размещена на странице
                по адресу https://www.if76.ru/privacy-policy Политика использования cookie-файлов Мы
                используем cookie-файлы, веб-маяки и иные схожие технологии для того, чтобы отличить вас
                от других пользователей нашего ресурса. Это позволяет обеспечивать удобный просмотр нашего
                сайта, а также даёт возможность улучшать его. Что такое cookie-файлы? Cookie-файлы
                представляют собой небольшие фрагменты данных, которые сохраняются в браузере компьютера,
                мобильного телефона или другого устройства после посещения веб-сайтов. Cookie-файлы широко
                применяются для поддержания работы веб-сайтов и сбора статистики. Как мы используем
                cookie-файлы? Информация, которую мы собираем с помощью файлов cookie-файлов, помогает
                нам анализировать то, как используется наш веб-сайт, чтобы мы могли сделать его максимально
                удобным и функциональным. Персональные данные сохраняются в cookie-файлах, если вы
                согласились на их использование. Это обеспечивает защищенный вход в личный кабинет, что
                технически необходимо. Какие типы cookie-файлов мы используем? Технические cookie-файлы
                Использование этих функциональных cookie-файлов нельзя запретить при посещении нашего сайта,
                так как они обеспечивают корректную работу веб-сайта. Сюда относятся cookie-файлы, которые
                собирают информацию о том, разрешено или запрещено использование других cookie-файлов с нашего
                сайта. Cookie-файлы сеанса посещения и cookie-файлы предпочтений Данные cookie-файлы позволяют
                войти в защищенные разделы нашего сайта. Срок действия таких cookie-файлов истекает по
                окончании сеанса посещения. Мы также можем использовать cookie-файлы, которые действуют
                дольше и создаются для того, чтобы запомнить ваши предпочтения и варианты выбора во время
                посещения нашего сайта. Жизненный цикл таких cookie-файлов не превышает одного года. Аналитические
                файлы cookie Мы используем средства веб-аналитики с целью общего анализа использования сайта
                и получения исходных данных для улучшения наших предложений. Полученная при этом информация
                может передаваться в анонимной форме на сервер службы веб-аналитики, сохраняться и обрабатываться
                там. Мы можем использовать аналитические инструменты и соответствующие cookie-файлы следующих
                поставщиков услуг: Google Analytics: Политика конфиденциальности Google Яндекс.Метрика: Политика
                конфиденциальности Яндекс Иные аналитические инструменты, разрешенные для свободного использования
                в обозначенных выше целях. Веб-маяки Веб-маяки – небольшие графические изображения (также
                называемые «пиксельными тегами» или «чистыми GIF»), которые могут размещаться на наших веб-сайтах
                и внедряться в наши сервисы, приложения, сообщения и инструменты. Веб-маяки могут использоваться
                для различных целей, включая оценку эффективности работы наших веб-сайтов, мониторинг количества
                посетителей и их поведения на наших веб-сайтах, определение доли реально прочитанных электронных
                писем от общего числа всех отправленных писем, контроль эффективности нашей рекламы и подсчёт
                количества фактически просмотренных страниц, статей и ссылок. Например: Facebook Pixel: Политика
                использования данных Facebook ВКонтакте Пиксель: Правила защиты информации о пользователях
                сайта VK.com Иные веб-маяки, разрешенные для свободного использования в обозначенных выше целях.
                Аналогичные технологии для хранения информации Аналогичные технологии для хранения информации –
                технологии, позволяющие записывать определённую информацию в кэш-память веб-браузера или в
                память устройства с помощью локальных объектов общего пользования или локально сохраняемых данных,
                таких как cookie-файлы формата Flash и HTML 5 и прочие элементы прикладного программного
                обеспечения для интернета. Эти технологии могут применяться во всех используемых веб-браузерах.
                В некоторых случаях управление использование локально сохраняемых данных с помощью веб-браузера
                в полном объёме невозможно и требует специальных инструментов. Подобные технологии хранения информации
                могут использоваться нами для защиты данных вашей учетной записи или для выявления нестандартных
                действий при использовании браузера в целях предотвращения несанкционированного доступа к вашей учетной
                записи или оценки эффективности функционирования наших веб-сайтов, сервисов, приложений или инструментов.
                Как можно разрешить или запретить использование cookie-файлов? Большинство браузеров автоматически
                принимают cookie-файлы. На вашем устройстве вы можете удалить сохраненные cookie-файлы в любое время.
                Как это делается более подробно, вы можете найти в инструкции по использованию вашего браузера или
                устройстве производителя. В настройках браузера также можно запретить любые cookie-файлы или только
                определенные. Однако все браузеры отличаются друг от друга, поэтому более подробная информация о
                настройках для cookie-файлов приведена в разделе Help («Справка») вашего браузера. Обращаем внимание
                что, отключив cookie-файлы, вы не сможете пользоваться некоторыми функциями, сервисами, инструментами
                и приложениями нашего сайта.
            </div>
            <Footer/>
        </div>
    )
}

export default PrivacyPolicy