import { Sale } from '../../../../classes/classes'

export const sales = [
    new Sale(
        ['1.03.2024', '8.03.2024'],
        '8 марта',
        'День всех женщин сулит за собой акцию, на все абонемнты скидка 20%!',
        [
            {
                name: '4 ЗАНЯТИЯ',
                prevPrice: 1500,
                newPrice: 1500 * 0.8
            },
            {
                name: 'БЕЗЛИМИТ (УЧЕНИЧ.)',
                prevPrice: 1750,
                newPrice: 1750 * 0.8
            },
            {
                name: '8 ЗАНЯТИЙ (ДНЕВНОЙ)',
                prevPrice: 1900,
                newPrice: 1900 * 0.8
            },
            {
                name: '12 ЗАНЯТИЙ (ДНЕВНОЙ)',
                prevPrice: 2250,
                newPrice: 2250 * 0.8
            },
            {
                name: '8 ЗАНЯТИЙ',
                prevPrice: 2250,
                newPrice: 2250 * 0.8
            },
            {
                name: '12 ЗАНЯТИЙ',
                prevPrice: 2850,
                newPrice: 2850 * 0.8
            },
            {
                name: 'БЕЗЛИМИТ (ДНЕВНОЙ)',
                prevPrice: 2600,
                newPrice: 2600 * 0.8
            },
            {
                name: 'БЕЗЛИМИТ',
                prevPrice: 3350,
                newPrice: 3350 * 0.8
            },
        ]
    ),
    new Sale(
        ['15.02.2024', '23.02.2024'],
        'День защитника отечества',
        'День защитника отечества не обойдется без скидок для мужчин и женщин в погонах!',
        [
            {
                name: '4 ЗАНЯТИЯ',
                prevPrice: 1500,
                newPrice: 1500 * 0.8
            },
            {
                name: 'БЕЗЛИМИТ (УЧЕНИЧ.)',
                prevPrice: 1750,
                newPrice: 1750 * 0.8
            },
            {
                name: '8 ЗАНЯТИЙ (ДНЕВНОЙ)',
                prevPrice: 1900,
                newPrice: 1900 * 0.8
            },
            {
                name: '12 ЗАНЯТИЙ (ДНЕВНОЙ)',
                prevPrice: 2250,
                newPrice: 2250 * 0.8
            },
            {
                name: '8 ЗАНЯТИЙ',
                prevPrice: 2250,
                newPrice: 2250 * 0.8
            },
            {
                name: '12 ЗАНЯТИЙ',
                prevPrice: 2850,
                newPrice: 2850 * 0.8
            },
            {
                name: 'БЕЗЛИМИТ (ДНЕВНОЙ)',
                prevPrice: 2600,
                newPrice: 2600 * 0.8
            },
            {
                name: 'БЕЗЛИМИТ',
                prevPrice: 3350,
                newPrice: 3350 * 0.8
            },
        ]

    ),
    new Sale(
        ['1.02.2024', '14.02.2024'],
        'День влюбленных',
        'В честь дня влюбленных скидки на все абонементы 14%',
        [
            {
                name: '4 ЗАНЯТИЯ',
                prevPrice: 1500,
                newPrice: 1500 * 0.86
            },
            {
                name: 'БЕЗЛИМИТ (УЧЕНИЧ.)',
                prevPrice: 1750,
                newPrice: 1750 * 0.86
            },
            {
                name: '8 ЗАНЯТИЙ (ДНЕВНОЙ)',
                prevPrice: 1900,
                newPrice: 1900 * 0.86
            },
            {
                name: '12 ЗАНЯТИЙ (ДНЕВНОЙ)',
                prevPrice: 2250,
                newPrice: 2250 * 0.86
            },
            {
                name: '8 ЗАНЯТИЙ',
                prevPrice: 2250,
                newPrice: 2250 * 0.86
            },
            {
                name: '12 ЗАНЯТИЙ',
                prevPrice: 2850,
                newPrice: 2850 * 0.86
            },
            {
                name: 'БЕЗЛИМИТ (ДНЕВНОЙ)',
                prevPrice: 2600,
                newPrice: 2600 * 0.86
            },
            {
                name: 'БЕЗЛИМИТ',
                prevPrice: 3350,
                newPrice: 3350 * 0.86
            },
        ]
    ),
    new Sale(
        ['10.01.2024', '31.01.2024'],
        'Январская акция',
        'Успейте воспользоваться нашей январской акцией! С 10 по 31 января при покупке дневного абонемента вы получаете специальную скидку. Не упустите возможность заботиться о своем здоровье по выгодной цене!',
        [
            {
                name: '8 ЗАНЯТИЙ (ДНЕВНОЙ)',
                prevPrice: 1900,
                newPrice: 1000
            },
            {
                name: '12 ЗАНЯТИЙ (ДНЕВНОЙ)',
                prevPrice: 2250,
                newPrice: 1150
            },
            {
                name: 'БЕЗЛИМИТ (ДНЕВНОЙ)',
                prevPrice: 2600,
                newPrice: 1300
            }
        ]
    ),
    new Sale(
        ['5.12.2023', '9.01.2024'],
        'Новогодняя акция',
        'Сейчас действует особое предложение: при покупке абонемента на месяц действует скидка 24%! Приходите вместе с друзьями и получите возможность улучшить свою физическую форму по выгодной цене!',
        [
            {
                name: '4 ЗАНЯТИЯ',
                prevPrice: 1500,
                newPrice: 1500 * 0.76
            },
            {
                name: 'БЕЗЛИМИТ (УЧЕНИЧ.)',
                prevPrice: 1750,
                newPrice: 1750 * 0.76
            },
            {
                name: '8 ЗАНЯТИЙ (ДНЕВНОЙ)',
                prevPrice: 1900,
                newPrice: 1900 * 0.76
            },
            {
                name: '12 ЗАНЯТИЙ (ДНЕВНОЙ)',
                prevPrice: 2250,
                newPrice: 2250 * 0.76
            },
            {
                name: '8 ЗАНЯТИЙ',
                prevPrice: 2250,
                newPrice: 2250 * 0.76
            },
            {
                name: '12 ЗАНЯТИЙ',
                prevPrice: 2850,
                newPrice: 2850 * 0.76
            },
            {
                name: 'БЕЗЛИМИТ (ДНЕВНОЙ)',
                prevPrice: 2600,
                newPrice: 2600 * 0.76
            },
            {
                name: 'БЕЗЛИМИТ',
                prevPrice: 3350,
                newPrice: 3350 * 0.76
            },
        ]
    ),
    new Sale(
        ['6.11.2023', '4.12.2023'],
        'Открытие',
        'В связи с открытием нашего тренажерного зала мы рады предложить вам уникальную акцию: при покупке абонемента на месяц вы получаете скидку 20%! Это прекрасный шанс начать заботиться о своем здоровье',
        [
            {
                name: '4 ЗАНЯТИЯ',
                prevPrice: 1500,
                newPrice: 1500 * 0.8
            },
            {
                name: 'БЕЗЛИМИТ (УЧЕНИЧ.)',
                prevPrice: 1750,
                newPrice: 1750 * 0.8
            },
            {
                name: '8 ЗАНЯТИЙ (ДНЕВНОЙ)',
                prevPrice: 1900,
                newPrice: 1900 * 0.8
            },
            {
                name: '12 ЗАНЯТИЙ (ДНЕВНОЙ)',
                prevPrice: 2250,
                newPrice: 2250 * 0.8
            },
            {
                name: '8 ЗАНЯТИЙ',
                prevPrice: 2250,
                newPrice: 2250 * 0.8
            },
            {
                name: '12 ЗАНЯТИЙ',
                prevPrice: 2850,
                newPrice: 2850 * 0.8
            },
            {
                name: 'БЕЗЛИМИТ (ДНЕВНОЙ)',
                prevPrice: 2600,
                newPrice: 2600 * 0.8
            },
            {
                name: 'БЕЗЛИМИТ',
                prevPrice: 3350,
                newPrice: 3350 * 0.8
            },
        ]
    )
]